{
  "permissions": {
    "sidePanel": "Proofly uses the sidePanel permission to provide a dedicated sidebar interface where users can review all writing issues found on the page, navigate through them, and apply corrections without obstructing the main content.",
    "tabs": "The tabs permission is required to track the active tab's state, update the extension badge with the count of detected issues for the current page, and ensure the side panel displays information relevant to the active tab.",
    "storage": "Proofly uses the storage permission to persist user preferences (such as enabled correction types and auto-correct settings) and to track the initialization state of the on-device AI model.",
    "contextMenus": "The contextMenus permission is needed to add a 'Proofread with Proofly' entry to the browser's context menu, allowing users to manually trigger proofreading on selected text or specific input fields.",
    "hostPermissions": "Proofly requires access to all websites (<all_urls>) to inject its content script, which detects text input fields (like textareas and contenteditable elements) and provides real-time proofreading and grammar correction suggestions directly on the page where the user is writing."
  },
  "singlePurpose": {
    "description": "Proofly is a privacy-focused writing assistant that uses Chrome's built-in on-device AI to proofread text, correct grammar, and fix spelling errors directly within the browser, ensuring no user data ever leaves the device."
  },
  "storeListing": {
    "description": "Proofly - Private AI Writing, Proofreading & Grammar Assistant\n\nProofly is a free, privacy-first Chrome extension that brings professional-grade writing assistance directly to your browser using Chrome's Built-in AI technology. Unlike other writing assistants that send your data to the cloud, Proofly runs 100% locally on your device, ensuring your keystrokes and personal information never leave your machine.\n\nKEY FEATURES:\n\n🔒 100% Private & Offline\n• Zero data transmission - everything stays on your device\n• Works completely offline after initial model download\n• No tracking, no telemetry, no account required\n\n✨ Intelligent Proofreading\n• Powered by Chrome's built-in Gemini Nano model\n• Instantly catches spelling, grammar, and punctuation errors\n• Fixes capitalization, missing words, and preposition usage\n\n🚀 Seamless Integration\n• Works on input fields, textareas, and contenteditable elements\n• Lightweight and non-invasive UI\n• Native-feeling underlines and correction popovers\n• Dedicated sidebar for reviewing all issues at once\n\n⚙️ Customizable Experience\n• Toggle specific correction types (e.g., check grammar but ignore capitalization)\n• Custom keyboard shortcuts\n• Auto-correct and manual trigger modes\n\nWhy Proofly?\nMost grammar checkers require you to trust them with your private emails, documents, and messages. Proofly eliminates this risk by leveraging the AI capabilities already built into your Chrome browser. It's the secure, free, and open-source alternative for anyone who values privacy.\n\nNote: Proofly requires Chrome 141+ and a device capable of running Chrome's built-in AI models."
  }
}
